secret/perf.org
#+TITLE: Profile application with Linux perf
#+AUTHOR: Sholde
#+DATE: May 2021

#+OPTIONS: html-postamble:nil

# Pur html
#+HTML_HEAD: <style>* {font-family:'Courier New';}</style>
#+HTML_HEAD: <style>html {background-color: #000000; color: #e5e5e5;}</style>
#+HTML_HEAD: <style>body {background-color: #101010; margin: 100px;}</style>
#+HTML_HEAD: <style>div#content {padding: 10px; border: 1px solid white;}</style>
#+HTML_HEAD: <style>div#table-of-contents {background-color: #202020; margin: 20px; padding: 10px; border: 1px solid white;}</style>
#+HTML_HEAD: <style>div.outline-2 {background-color: #202020; margin: 20px; padding: 10px; border: 1px solid white;}</style>
#+HTML_HEAD: <style>h2 {border-bottom: 1px solid white;}</style>
#+HTML_HEAD: <style>h3 {border-bottom: 1px solid white;}</style>
#+HTML_HEAD: <style>a {text-decoration:none; color: #e5e5e5;}</style>
#+HTML_HEAD: <style>li {list-style-type: none;}</style>
#+HTML_HEAD: <style>a:hover {color: #00ff00; padding-left: 10px;}</style>

# Source
#+HTML_HEAD: <style>div#org-src-container {background-color: #303030; box-shadow: none;}</style>
#+HTML_HEAD: <style>pre:hover {border: 2px solid green;}</style>
#+HTML_HEAD: <style>pre {background-color: #303030; border: 2px solid white; box-shadow: none;}</style>
#+HTML_HEAD: <style>pre.src {background-color: #303030; color: #e5e5e5;}</style>
#+HTML_HEAD: <style>pre.src:before {color: #000000;}</style>

* Linux perf
** Trace an application

   #+BEGIN_SRC shell
     perf record --call-graph lbr ./test
   #+END_SRC

** Flat mode (pur sampling) no call-stack

   #+BEGIN_SRC shell
     perf record ./test
   #+END_SRC
  
  (better callstack for hotspot)

** Output
*** Base output

    #+BEGIN_SRC shell
      perf report --stdio
    #+END_SRC
  
*** Curses output

    #+BEGIN_SRC shell
      perf report
    #+END_SRC
  
** Annotate only one function

    #+BEGIN_SRC shell
      perf annotate main [--stdio]
    #+END_SRC
 
** Wrapper for MPI

   #+BEGIN_SRC shell
     #!/bin/sh

     H=`hostname`
     P=$$

     perf record -o perf-${H}-${P}.data  $@
   #+END_SRC
  
*** Usage

    #+BEGIN_SRC shell
      mpirun -np 4 mpiperf ./program options
    #+END_SRC

** Profile ALL the system (in root or with good parameter)

   #+BEGIN_SRC shell
     perf record -a --call-graph lbr
   #+END_SRC

*** With curses

    #+BEGIN_SRC shell
      perf top
    #+END_SRC
  
* Hotspot

  *Link:* https://github.com/KDAB/hotspot

  #+BEGIN_SRC shell
    hostspot ./perf.dat
  #+END_SRC

* Memory tracking

  *Link:* https://github.com/memtt/malt


