secret/perf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-15 sam. 19:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Profile application with Linux perf</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sholde" />
</head>
<body>
<div id="content">
<h1 class="title">Profile application with Linux perf</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb3917fe">1. Linux perf</a>
<ul>
<li><a href="#org04a38bc">1.1. Trace an application</a></li>
<li><a href="#orgf3059b5">1.2. Flat mode (pur sampling) no call-stack</a></li>
<li><a href="#orgdec6d9c">1.3. Output</a>
<ul>
<li><a href="#org6fef5b2">1.3.1. Base output</a></li>
<li><a href="#org0895a0d">1.3.2. Curses output</a></li>
</ul>
</li>
<li><a href="#org4a5ea05">1.4. Annotate only one function</a></li>
<li><a href="#org5e65c8f">1.5. Wrapper for MPI</a>
<ul>
<li><a href="#org0724d18">1.5.1. Usage</a></li>
</ul>
</li>
<li><a href="#orga4c3b72">1.6. Profile ALL the system (in root or with good parameter)</a>
<ul>
<li><a href="#org751e3f0">1.6.1. With curses</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org88d929b">2. Hotspot</a></li>
<li><a href="#org40d129e">3. Memory tracking</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb3917fe" class="outline-2">
<h2 id="orgb3917fe"><span class="section-number-2">1</span> Linux perf</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org04a38bc" class="outline-3">
<h3 id="org04a38bc"><span class="section-number-3">1.1</span> Trace an application</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-shell">perf record --call-graph lbr ./test
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3059b5" class="outline-3">
<h3 id="orgf3059b5"><span class="section-number-3">1.2</span> Flat mode (pur sampling) no call-stack</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-shell">perf record ./test
</pre>
</div>

<p>
(better callstack for hotspot)
</p>
</div>
</div>

<div id="outline-container-orgdec6d9c" class="outline-3">
<h3 id="orgdec6d9c"><span class="section-number-3">1.3</span> Output</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org6fef5b2" class="outline-4">
<h4 id="org6fef5b2"><span class="section-number-4">1.3.1</span> Base output</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-shell">perf report --stdio
</pre>
</div>
</div>
</div>

<div id="outline-container-org0895a0d" class="outline-4">
<h4 id="org0895a0d"><span class="section-number-4">1.3.2</span> Curses output</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">
<pre class="src src-shell">perf report
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4a5ea05" class="outline-3">
<h3 id="org4a5ea05"><span class="section-number-3">1.4</span> Annotate only one function</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-shell">perf annotate main [--stdio]
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e65c8f" class="outline-3">
<h3 id="org5e65c8f"><span class="section-number-3">1.5</span> Wrapper for MPI</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #998f84;">#</span><span style="color: #998f84;">!/bin/</span><span style="color: #ff2c4b; font-weight: bold;">sh</span>

<span style="color: #ffa724;">H</span>=<span style="color: #fa8072;">`hostname`</span>
<span style="color: #ffa724;">P</span>=$<span style="color: #ffa724;">$</span>

perf record -o perf-${<span style="color: #ffa724;">H</span>}-${<span style="color: #ffa724;">P</span>}.data  $<span style="color: #ffa724;">@</span>
</pre>
</div>
</div>

<div id="outline-container-org0724d18" class="outline-4">
<h4 id="org0724d18"><span class="section-number-4">1.5.1</span> Usage</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">
<pre class="src src-shell">mpirun -np 4 mpiperf ./program options
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga4c3b72" class="outline-3">
<h3 id="orga4c3b72"><span class="section-number-3">1.6</span> Profile ALL the system (in root or with good parameter)</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-shell">perf record -a --call-graph lbr
</pre>
</div>
</div>

<div id="outline-container-org751e3f0" class="outline-4">
<h4 id="org751e3f0"><span class="section-number-4">1.6.1</span> With curses</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">
<pre class="src src-shell">perf top
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org88d929b" class="outline-2">
<h2 id="org88d929b"><span class="section-number-2">2</span> Hotspot</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Link:</b> <a href="https://github.com/KDAB/hotspot">https://github.com/KDAB/hotspot</a>
</p>

<div class="org-src-container">
<pre class="src src-shell">hostspot ./perf.dat
</pre>
</div>
</div>
</div>

<div id="outline-container-org40d129e" class="outline-2">
<h2 id="org40d129e"><span class="section-number-2">3</span> Memory tracking</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Link:</b> <a href="https://github.com/memtt/malt">https://github.com/memtt/malt</a>
</p>
</div>
</div>
</div>
</body>
</html>
